<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"13c3883787cc31d9a553318d84bc942e0b4778634492682ad8deb1ce817c8d20","plan_job_ref":"Job Test plan target and replace #427 at https://github.com/dflook/terraform-github-actions/actions/runs/10195046004","plan_out_hash":"99362a9970d4382ae5df5d93ffdcec9b480b3b4b38c1017c65ed4dfcfa437016","plan_hash":"122dec8534b4bb7be423665219fe1b61cecee083ee25616a656fd07313655dab","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "CtTBSz4KK8" -> (known after apply)
!~  foreach = "nkShoJVxFF" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #427](https://github.com/dflook/terraform-github-actions/actions/runs/10195046004)